#include <stdio.h>
#include <conio.h>
#pragma warning (disable:4996)
#include <stdlib.h>
#include <time.h>

//№1 - Составить программу замены первого элемента одномерного массива максимальным элементом,
//а последнего элемента - минимальным элементом.
//Вывести одной строкой элементы исходного и преобразованного массива.

main()
{

	const int N = 10; //размер массива
	int a[10] = { 3, 7, 9, 17, 66, 1, 8, 25, 2, 4 }; //массив целых чисел
	int i, k, j, max = a[0], min = a[0]; //переменные

	for (i = 0; i < N; i++) { //цикл вывода элементов исходного массива
		printf("%d", a[i]);
		if (i != N - 1) {
			printf(", ");
		}
	}

	printf(" "); //для лучшей читаемости

	for (i = 0; i < N; i++) //нахождение минимального элемента массива и его индекса
		if (a[i] > max) {
			max = a[i];
			k = i;
		}

	for (i = 0; i < N; i++) //нахождение максимального элемента массива и его индекса
		if (a[i] < min) {
			min = a[i];
			j = i;
		}

	a[j] = a[0]; //замена элементов после преобразований
	a[k] = a[N - 1];
	a[0] = max;
	a[N - 1] = min;

	for (i = 0; i < N; i++) { //цикл вывода элементов преобразованного массива
		printf("%d", a[i]);
		if (i != N - 1) {
			printf(", ");
		}
	}

}


//№2 - Составить программу замены первого отрицательного элемента
//одномерного массива суммой положительных элементов.
//Если замена невозможна, то вывести сообщение об этом.
//Вывести одной строкой элементы исходного и преобразованного массива.

main()
{
	const int N = 10; //размер массива
	int a[10] = { 17, 8, 9, 13, 1, -25, 7, 34, 6, 99 }; //массив целых чисел
	int i, j, sum, neg_num = 0; //переменные

	for (i = 0; i < N; i++) { //цикл вывода элементов исходного массива
		printf("%d", a[i]);
		if (i != N - 1) {
			printf(", ");
		}
	}

	printf(" "); //для лучшей читаемости

	for (i = 0; i < N; i++) //нахождение отрицательного элемента и его индекса
		if (a[i] < neg_num) {
			neg_num = a[i];
			j = i;
		}

	for (i = 0, sum = 0; i < N; sum += a[i++]); //нахождение суммы элементов

	a[j] = sum; //замена элементов после преобразований

	for (i = 0; i < N; i++) { //цикл вывода элементов преобразованного массива
		printf("%d", a[i]);
		if (i != N - 1) {
			printf(", ");
		}
	}

}


//№3 - Составить программу, которая преобразует одномерный целочисленный массив так,
//чтобы все его элементы содержащие нечётные числа остались на своих местах,
//а все его элементы содержащие чётные числа расположились в обратном порядке.
//Вывести одной строкой элементы исходного и преобразованного массива.

main()
{
	const int N = 10; //размер массива
	const unsigned short RANGE = 100; //верхняя граница диапазона
	int i, a[10], b[10], j = 0, count = 0; //переменные

	srand((unsigned)time(NULL)); //инициализация датчика случайных чисел

	for (i = 0; i < N; i++) { //цикл вывода элементов исходного массива
		a[i] = (int)(rand() % RANGE);
		printf("%d", a[i]);
		if (i != N - 1) {
			printf(", ");
		}
	}

	for (i = 0; i < N; i++) { //поиск чётных элементов, добавление их во вспомогательный массив и увеличение индекса четного массива
		if ((a[i] % 2) == 0) {
			b[j] = a[i];
			j++;
		}
	}

	printf(" "); //для лучшей читаемости

	for (i = 0; i < N; i++) { //цикл вывода массива с изменением порядка чётных элементов
		if ((a[i] % 2) == 0) {
			j--;
			printf("%d", a[i] = b[j]); //сменя порядка чётных элементов и их вывод
		}

		else {
			printf("%d", a[i]); //вывод нечётных элементов
		}

		if (i != N - 1) {
			printf(", ");
		}
	}

}